testsrc/main/mondrian/xmla/excel_XP/excel_XP_01_in.xml

<?xml version="1.0"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Header/>
  <Body>
    <Discover xmlns="urn:schemas-microsoft-com:xml-analysis">
      <RequestType>DISCOVER_DATASOURCES</RequestType>
      <Restrictions/>
      <Properties>
        <PropertyList>
          <LocaleIdentifier>1033</LocaleIdentifier>
          <Content>SchemaData</Content>
          <Format>Tabular</Format>
        </PropertyList>
      </Properties>
    </Discover>
  </Body>
</Envelope>
